In [1]:
import pandas as pd
import numpy as np

# Input and Output With the `CSV` file

In [6]:
mydata = {'Name': ['A', 'B', 'C'], 
        'Age': [10, 20, 30], 
         'Gender': ['M', 'F', 'F']}

In [7]:
df = pd.DataFrame(mydata)

In [8]:
df

  Name  Age Gender
0    A   10      M
1    B   20      F
2    C   30      F

### ` Saving the above given data into the CSV file using the .to_csv method `

In [13]:
df.to_csv('new_demo')

In [14]:
pd.read_csv('new_demo')

   Unnamed: 0 Name  Age Gender
0           0    A   10      M
1           1    B   20      F
2           2    C   30      F

In [15]:
df.to_csv('new_demo', index=False)

In [17]:
pd.read_csv('new_demo')

  Name  Age Gender
0    A   10      M
1    B   20      F
2    C   30      F